Repository: Marcelors/books
Catalog: src/books-api/Books.Domain.Shared/Resources/DomainError.*.resx
Languages: pt_br

source: Profile is required
pt_br: Perfil é obrigatório

source: Name is required
pt_br: Nome é obrigatório

# MaximumNameSize
source: Maximum name size is {0}
pt_br: tamanho máximo do nome é {0}

source: Email is required
pt_br: Email é obrigatório

# MaximumEmailSize
source: Maximum email size is {0}
pt_br: tamanho máximo do email é {0}

# AuthorsIsRequired
source: At least one author is necessary
pt_br: Pelo menos um autor é necessário

source: Book Id is required
pt_br: Id do Livro é obrigatório

# MaximumBookIdSize
source: Maximum book id size is {0}
pt_br: tamanho máximo do id do livro é {0}

source: Link is required
pt_br: Link é obrigatório

# MaximumLinkSize
source: Maximum link size is {0}
pt_br: tamanho máximo do link é {0}

source: Title is required
pt_br: Titulo é obrigatório

# MaximumTitleSize
source: Maximum title size is {0}
pt_br: tamanho máximo do titulo é {0}

source: User is required
pt_br: usuário é obrigatório

source: User not found
pt_br: Usuário não encontrado

source: search is required
pt_br: pesquisa é obrigatório

source: current page is required
pt_br: pagina atual é obrigatória

source: Favorite book not found
pt_br: Livro Favorito não encontrado

source: Items per page is required
pt_br: Itens por página

# TheValueCannotBeGreaterThan
source: The value cannot be greater than: {0}
pt_br: O valor não pode ser maior que: {0}

# SearchMustBeAtLeastCharacters
source: search must be at least {0} characters
pt_br: a pesquisa deve ter pelo menos {0} caracteres

source: Standard profile user does not have permission
pt_br: Usuário do perfil standard não tem permissão
